MiguelBertonzin/STR_Modelagem_Sistema/sdkconfig.defaults
# Configuracao inicial usada para uma compilacao reproduzivel do projeto.
# Frequencia e modo do escalonador devem ser alterados conforme a matriz de testes.
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_UNICORE=y
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_RUN_TIME_STATS_USING_ESP_TIMER=y
